## ACD MDS Assignment 14 (SQL -2)
### Mar 2018 batch - Student: K. Anandaranga

In [1]:
#Read the following data set:
#https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data
#Task:
#1. Create an sqlalchemy engine using a sample from the data set
#2. Write two basic update queries
#3. Write two delete queries
#4. Write two filter queries
#5. Write two function queries

In [2]:
import numpy as np
import pandas as pd
import sqlite3 as db

from pandasql import sqldf

import sqlalchemy
from sqlalchemy import create_engine
engine = create_engine('sqlite:///:memory:', echo=False)

#from sqlalchemy.orm import sessionmaker
#Session = sessionmaker(bind=engine)
#session = Session()

In [3]:
df = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data', header = None)
df.columns = ['age', 'workclass', 'fnlwgt', 'education', 'education-num', 'marital-status', 'occupation', 'relationship', 'race', 'sex', 'capital-gain', 'capital-loss', 'hours-per-week', 'native-country', 'Above_Below_50K_year']

df.to_sql ('sqladb', con=engine , if_exists="replace")

In [4]:
#1. Create an sqlalchemy engine using a sample from the data set

engine.execute("SELECT * FROM sqladb LIMIT 10").fetchall()

[(0, 39, ' State-gov', 77516, ' Bachelors', 13, ' Never-married', ' Adm-clerical', ' Not-in-family', ' White', ' Male', 2174, 0, 40, ' United-States', ' <=50K'),
 (1, 50, ' Self-emp-not-inc', 83311, ' Bachelors', 13, ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' White', ' Male', 0, 0, 13, ' United-States', ' <=50K'),
 (2, 38, ' Private', 215646, ' HS-grad', 9, ' Divorced', ' Handlers-cleaners', ' Not-in-family', ' White', ' Male', 0, 0, 40, ' United-States', ' <=50K'),
 (3, 53, ' Private', 234721, ' 11th', 7, ' Married-civ-spouse', ' Handlers-cleaners', ' Husband', ' Black', ' Male', 0, 0, 40, ' United-States', ' <=50K'),
 (4, 28, ' Private', 338409, ' Bachelors', 13, ' Married-civ-spouse', ' Prof-specialty', ' Wife', ' Black', ' Female', 0, 0, 40, ' Cuba', ' <=50K'),
 (5, 37, ' Private', 284582, ' Masters', 14, ' Married-civ-spouse', ' Exec-managerial', ' Wife', ' White', ' Female', 0, 0, 40, ' United-States', ' <=50K'),
 (6, 49, ' Private', 160187, ' 9th', 5, ' Married-spouse-absent', ' Other-service', ' Not-in-family', ' Black', ' Female', 0, 0, 16, ' Jamaica', ' <=50K'),
 (7, 52, ' Self-emp-not-inc', 209642, ' HS-grad', 9, ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' White', ' Male', 0, 0, 45, ' United-States', ' >50K'),
 (8, 31, ' Private', 45781, ' Masters', 14, ' Never-married', ' Prof-specialty', ' Not-in-family', ' White', ' Female', 14084, 0, 50, ' United-States', ' >50K'),
 (9, 42, ' Private', 159449, ' Bachelors', 13, ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' White', ' Male', 5178, 0, 40, ' United-States', ' >50K')]

In [5]:
# In prep for Q2, first get the breakdown of one of the column values

out3_1 = engine.execute("SELECT [education], count(*) as cnt FROM sqladb GROUP BY [education] order  by cnt DESC").fetchall()
#out

df3_1 = pd.DataFrame.from_dict(out3_1)
df3_1.columns = ("education", "count")
df3_1

# Notice the 2 values - Preschool and Doctorate

        education  count
0         HS-grad  10501
1    Some-college   7291
2       Bachelors   5355
3         Masters   1723
4       Assoc-voc   1382
5            11th   1175
6      Assoc-acdm   1067
7            10th    933
8         7th-8th    646
9     Prof-school    576
10            9th    514
11           12th    433
12      Doctorate    413
13        5th-6th    333
14        1st-4th    168
15      Preschool     51

In [6]:
#2. Write two basic update queries

engine.execute ("UPDATE sqladb SET [education] = 'nonsense' WHERE [education] =' Preschool'")  # Update the education status of "Preschool" to read something else

engine.execute ("UPDATE sqladb SET [education] = 'PhD' WHERE [education] =' Doctorate'") # Update the category of "Doctorate" to be something else

out3_1 = engine.execute("SELECT [education], count(*) as cnt FROM sqladb GROUP BY [education] order  by cnt DESC").fetchall()  # Select query to validate the changes
out3_1

# Note the categories for Preschool and Doctorate are now changed

[(' HS-grad', 10501),
 (' Some-college', 7291),
 (' Bachelors', 5355),
 (' Masters', 1723),
 (' Assoc-voc', 1382),
 (' 11th', 1175),
 (' Assoc-acdm', 1067),
 (' 10th', 933),
 (' 7th-8th', 646),
 (' Prof-school', 576),
 (' 9th', 514),
 (' 12th', 433),
 ('PhD', 413),
 (' 5th-6th', 333),
 (' 1st-4th', 168),
 ('nonsense', 51)]

In [7]:
#3. Write two delete queries
# Again, now deleting the records pertaining to these two categories in the 'education' column

engine.execute ("DELETE from sqladb WHERE [education] = ' nonsense'")

engine.execute ("DELETE from sqladb WHERE [education] = ' PhD'")

In [8]:
engine.execute("SELECT count(*) FROM sqladb WHERE [education] = ' nonsense'").fetchall() # to verify that the records don't exist anymore

[(0,)]

In [9]:
engine.execute("SELECT count(*) FROM sqladb WHERE [education] = ' PhD'").fetchall() # to verify that the records don't exist anymore

[(0,)]

In [10]:
#4. Write two filter queries

# a simple variation of filtering out certain specific records in the 'education' column
engine.execute("SELECT * FROM sqladb WHERE [education] = ' 1st-4th' LIMIT 10").fetchall()

[(160, 68, ' ?', 38317, ' 1st-4th', 2, ' Divorced', ' ?', ' Not-in-family', ' White', ' Female', 0, 0, 20, ' United-States', ' <=50K'),
 (221, 64, ' ?', 187656, ' 1st-4th', 2, ' Divorced', ' ?', ' Not-in-family', ' White', ' Male', 0, 0, 40, ' United-States', ' <=50K'),
 (416, 52, ' Private', 190762, ' 1st-4th', 2, ' Married-civ-spouse', ' Machine-op-inspct', ' Husband', ' White', ' Male', 0, 0, 40, ' Mexico', ' <=50K'),
 (463, 50, ' Private', 193374, ' 1st-4th', 2, ' Married-spouse-absent', ' Craft-repair', ' Unmarried', ' White', ' Male', 0, 0, 40, ' United-States', ' <=50K'),
 (486, 63, ' ?', 401531, ' 1st-4th', 2, ' Married-civ-spouse', ' ?', ' Husband', ' White', ' Male', 0, 0, 35, ' United-States', ' <=50K'),
 (536, 57, ' Private', 190942, ' 1st-4th', 2, ' Widowed', ' Priv-house-serv', ' Not-in-family', ' Black', ' Female', 0, 0, 30, ' United-States', ' <=50K'),
 (929, 33, ' Private', 373662, ' 1st-4th', 2, ' Married-spouse-absent', ' Priv-house-serv', ' Not-in-family', ' White', ' Female', 0, 0, 40, ' Guatemala', ' <=50K'),
 (1139, 41, ' Private', 328447, ' 1st-4th', 2, ' Married-civ-spouse', ' Craft-repair', ' Husband', ' White', ' Male', 0, 0, 35, ' Mexico', ' <=50K'),
 (1291, 63, ' Self-emp-not-inc', 795830, ' 1st-4th', 2, ' Widowed', ' Other-service', ' Unmarried', ' White', ' Female', 0, 0, 30, ' El-Salvador', ' <=50K'),
 (1634, 37, ' Private', 405723, ' 1st-4th', 2, ' Married-civ-spouse', ' Machine-op-inspct', ' Husband', ' White', ' Male', 0, 0, 40, ' Mexico', ' <=50K')]

In [12]:
# another variation of filtering out certain specific records in the 'education' column

engine.execute("SELECT * FROM sqladb WHERE ([education] = ' 1st-4th' AND [sex] = ' Female')  LIMIT 10").fetchall()

[(160, 68, ' ?', 38317, ' 1st-4th', 2, ' Divorced', ' ?', ' Not-in-family', ' White', ' Female', 0, 0, 20, ' United-States', ' <=50K'),
 (536, 57, ' Private', 190942, ' 1st-4th', 2, ' Widowed', ' Priv-house-serv', ' Not-in-family', ' Black', ' Female', 0, 0, 30, ' United-States', ' <=50K'),
 (929, 33, ' Private', 373662, ' 1st-4th', 2, ' Married-spouse-absent', ' Priv-house-serv', ' Not-in-family', ' White', ' Female', 0, 0, 40, ' Guatemala', ' <=50K'),
 (1291, 63, ' Self-emp-not-inc', 795830, ' 1st-4th', 2, ' Widowed', ' Other-service', ' Unmarried', ' White', ' Female', 0, 0, 30, ' El-Salvador', ' <=50K'),
 (2581, 40, ' Private', 153799, ' 1st-4th', 2, ' Married-spouse-absent', ' Machine-op-inspct', ' Unmarried', ' White', ' Female', 0, 0, 40, ' Dominican-Republic', ' <=50K'),
 (2861, 44, ' Private', 367749, ' 1st-4th', 2, ' Never-married', ' Machine-op-inspct', ' Not-in-family', ' White', ' Female', 0, 0, 40, ' El-Salvador', ' <=50K'),
 (4718, 46, ' Private', 308334, ' 1st-4th', 2, ' Widowed', ' Other-service', ' Unmarried', ' Other', ' Female', 0, 0, 30, ' Mexico', ' <=50K'),
 (5842, 25, ' Private', 195994, ' 1st-4th', 2, ' Never-married', ' Priv-house-serv', ' Not-in-family', ' White', ' Female', 0, 0, 40, ' Guatemala', ' <=50K'),
 (7300, 50, ' Private', 92969, ' 1st-4th', 2, ' Separated', ' Prof-specialty', ' Unmarried', ' Black', ' Female', 0, 0, 40, ' United-States', ' <=50K'),
 (7319, 46, ' Private', 324601, ' 1st-4th', 2, ' Separated', ' Machine-op-inspct', ' Own-child', ' White', ' Female', 0, 0, 40, ' Guatemala', ' <=50K')]

In [13]:
#5. Write two function queries

# in-built functions such as average or min or max
engine.execute("SELECT avg([age]), min([age]), max([age]), [occupation] FROM sqladb GROUP BY [occupation] ").fetchall()

[(40.882799782962564, 17, 90, ' ?'),
 (36.96445623342175, 17, 90, ' Adm-clerical'),
 (30.22222222222222, 23, 46, ' Armed-Forces'),
 (39.03147109050988, 17, 90, ' Craft-repair'),
 (42.16920806689621, 17, 90, ' Exec-managerial'),
 (41.2112676056338, 17, 90, ' Farming-fishing'),
 (32.16569343065694, 17, 90, ' Handlers-cleaners'),
 (37.71528471528472, 17, 90, ' Machine-op-inspct'),
 (34.94962063732929, 17, 90, ' Other-service'),
 (41.7248322147651, 17, 81, ' Priv-house-serv'),
 (40.51763285024155, 17, 90, ' Prof-specialty'),
 (38.9537750385208, 17, 90, ' Protective-serv'),
 (37.353972602739724, 17, 90, ' Sales'),
 (37.022629310344826, 17, 73, ' Tech-support'),
 (40.19787100814026, 17, 90, ' Transport-moving')]

In [14]:
# using a mathematical operation on some in-built functions

engine.execute("SELECT (max ([age]) - min([age])) as range, [occupation] FROM sqladb GROUP BY [occupation] ").fetchall()

[(73, ' ?'),
 (73, ' Adm-clerical'),
 (23, ' Armed-Forces'),
 (73, ' Craft-repair'),
 (73, ' Exec-managerial'),
 (73, ' Farming-fishing'),
 (73, ' Handlers-cleaners'),
 (73, ' Machine-op-inspct'),
 (73, ' Other-service'),
 (64, ' Priv-house-serv'),
 (73, ' Prof-specialty'),
 (73, ' Protective-serv'),
 (73, ' Sales'),
 (56, ' Tech-support'),
 (73, ' Transport-moving')]